vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
// The page is streamed to the client in the fragments below, the device name/heading and the table
// rows are printed in between them. Do not copy these PROGMEM buffers into a String, they must be
// read with FPSTR()/pgm_read_* else the flash contents get read as garbage.
const char html_head[] PROGMEM = R"rawliteral(<!DOCTYPE HTML><html><head>
  <title>)rawliteral";

const char html_style[] PROGMEM = R"rawliteral(</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <style>
    html {font-family: Arial, sans-serif; display: inline-block; text-align: center;}
    h1 {font-size: 2.5rem; color: #333;}
    table {width: 100%; border-collapse: collapse; margin: 20px 0; font-size: 0.9rem;}
    th, td {padding: 8px; border: 1px solid #ddd; text-align: left;}
    th {background-color: #f2f2f2; color: #333;}
    tr:nth-child(even) {background-color: #f9f9f9;}
    tr:hover {background-color: #f1f1f1;}
    .device-filter {margin: 12px 0; text-align: left;}
    .device-filter input {padding: 6px; width: 240px; max-width: 70%;}
    .device-filter button {padding: 6px 12px;}
  </style>
  </head><body>
  <h1>)rawliteral";

const char html_table_start[] PROGMEM = R"rawliteral(</h1>
  <div class="device-filter">
    <label for="device-filter-input">Device name:</label>
    <input id="device-filter-input" type="text" placeholder="Enter device name">
    <button id="device-filter-button" type="button">Filter</button>
  </div>
  <table border='1'>
    <tr>
      <th>Time</th>
      <th>Message ID</th>
      <th>Device Name</th>
      <th>Message Type</th>
      <th>Sender MAC</th>
      <th>Int Value1</th>
      <th>Int Value2</th>
      <th>Int Value3</th>
      <th>Int Value4</th>
      <th>Float Value1</th>
      <th>Float Value2</th>
      <th>Float Value3</th>
      <th>Float Value4</th>
      <th>Char Value1</th>
      <th>Char Value2</th>
    </tr>
)rawliteral";

const char html_table_end[] PROGMEM = R"rawliteral(  </table>
  <script>
    var activeDeviceFilter = '';

    function applyDeviceFilter() {
      var filterInput = document.getElementById('device-filter-input');
      activeDeviceFilter = filterInput.value.trim().toLowerCase();
      var rows = document.querySelector('table').rows;

      for (var rowIndex = 1; rowIndex < rows.length; rowIndex++) {
        var deviceName = rows[rowIndex].cells[2].textContent.toLowerCase();
        rows[rowIndex].style.display = !activeDeviceFilter ||
          deviceName.indexOf(activeDeviceFilter) !== -1 ? '' : 'none';
      }
    }

    document.getElementById('device-filter-button').addEventListener('click', applyDeviceFilter);

    function formatClientTime() {
      return new Date().toLocaleTimeString([], {
        hour: 'numeric',
        minute: '2-digit',
        second: '2-digit',
        hour12: true
      });
    }

    document.querySelectorAll('[data-client-time]').forEach(function (cell) {
      cell.textContent = formatClientTime();
    });
  </script>
)rawliteral";

const char html_end[] PROGMEM = R"rawliteral(  </body></html>)rawliteral";

const char ws_script[] PROGMEM = R"rawliteral(
  <script>
    var ws = new WebSocket('ws://' + window.location.hostname + '/ws');
    ws.onmessage = function(event) {
      var table = document.querySelector('table');
      var row = table.insertRow(1); // Insert row at the top (after the header row)
      var data = JSON.parse(event.data);
      row.insertCell(0).textContent = formatClientTime();
      row.insertCell(1).textContent = data.message_id;
      row.insertCell(2).textContent = data.device_name;
      row.insertCell(3).textContent = data.msg_type;
      row.insertCell(4).textContent = data.sender_mac;
      row.insertCell(5).textContent = data.intvalue1;
      row.insertCell(6).textContent = data.intvalue2;
      row.insertCell(7).textContent = data.intvalue3;
      row.insertCell(8).textContent = data.intvalue4;
      row.insertCell(9).textContent = data.floatvalue1;
      row.insertCell(10).textContent = data.floatvalue2;
      row.insertCell(11).textContent = data.floatvalue3;
      row.insertCell(12).textContent = data.floatvalue4;
      row.insertCell(13).textContent = data.chardata1;
      row.insertCell(14).textContent = data.chardata2;
      applyDeviceFilter();
    };
  </script>)rawliteral";

#if defined(ESP32)
esp_now_peer_info_t peerInfo; // This object must be a global object else the setting of peer will fail
#endif
#if USING(SECURITY)
uint8_t kok[16]= PMK_KEY_STR;//comes from secrets.h
uint8_t key[16] = LMK_KEY_STR;// comes from secrets.h
#endif

espnow_message myData;
unsigned long start_time;
unsigned long last_msg_sent_time;
espnow_device esp_ota_device;
typedef struct gateway_stats
{
  unsigned long msg_count;
  unsigned long failed_msg_count;
  unsigned long cmnd_msg_count;
  float msg_rate;
  float free_mem_KB;// free memory in KB
  unsigned long uptime; // uptime in minutes
  int rssi;
  String str_mac;
  String str_macAP;
  short wifi_channel;
  short queue_length;
  String last_published_msg;
}gateway_stats;
gateway_stats gateway;

// ************ GLOBAL OBJECTS/VARIABLES *******************
#include "espnowController.h" //defines all utility functions for sending espnow messages from a controller


/*
 * connects to MQTT server , publishes LWT message as "online" every time it connects
 * waits for a time defined by MQTT_RETRY_INTERVAL before reconnecting again
 * I had issues with MQTT nto able to connect at times and so I included pinger to ping the gateway but then the issue hasnt happened for a long time now
 */
bool reconnectMQTT()
{
  if (!client.connected())
  {
    long now = millis();
    if ((now - lastReconnectAttempt > MQTT_RETRY_INTERVAL) || lastReconnectAttempt == 0) 
    {
      lastReconnectAttempt = now;
      DPRINTLN("Attempting MQTT connection...");
      // publishes the LWT message ("online") to the topic,If the this device disconnects from the broker ungracefully then the broker automatically posts the "offline" message on the LWT topic
      // so that all connected clients know that this device has gone offline
      char publish_topic[65] = ""; //variable accomodates 50 characters of main topic + 15 char of sub topic
      strcpy(publish_topic,MQTT_TOPIC);
      strcat(publish_topic,"/LWT"); 
      if (client.connect(DEVICE_NAME,mqtt_uname,mqtt_pswd,publish_topic,0,true,"offline")) {//credentials come from secrets.h
        DPRINTLN("MQTT connected");
        client.publish(publish_topic,"online",true);
        if(statusLED.getState() == LED_BLINKING)
          statusLED.cancel();
        return true;
      }
    }
    if(statusLED.getState() == LED_IDLE)
      statusLED.blink(1000, 500);
    return false;
  }
  if(statusLED.getState() == LED_BLINKING)
    statusLED.cancel();
  return true;
}

