vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
/*
 * Publishes a string message to MQTT , returns true if message was published successfully else false
 * IMPORTANT : Encountered a strange issue where the device was more than MAX_DEVICE_ID_LEN characters long, this caused the MQTT to return success for publish method but the message wasnt published
 * In the next step the MQTT conneciton was lost and it was re-established. So be careful of the length of the device name from the client side. Sample message below:  terrace_flow_meter is more than MAX_DEVICE_ID_LEN
 *  const char* json_msg = R"({"gateway":"gateway-ff","type":0,"mac":"62:01:94:FF:01:08","id":2,"device":"terrace_flow_meter","ival1":0,"ival2":0,"ival3":0,"ival4":0,"fval1":0,"fval2":0,"fval3":0,"fval4":0,"char1":"","char2":"1.0 Jan 11 2025"})";
 * This bug doesnt make sense as this finally is only a string in this method and the message was within MQTT_MAX_PACKET_SIZE (256). Didnt have time to debug this further so left it
 * The maximum length of a message that can be published on MQTT depends on the MQTT broker and the client library you are using. For the ESP8266 with the PubSubClient library, the default maximum message size is 256 bytes
 * #define MQTT_MAX_PACKET_SIZE 256 can be changed to #define MQTT_MAX_PACKET_SIZE 1024
 * Also be aware of : MAX_MSG_BUFFER_SIZE : This is the max size of the MQTT packet buffer, it includes topic name+payload+header bytes, set your payload max lenn accordingly using MAX_MESSAGE_LEN below
 * MAX_MESSAGE_LEN : defines max message length of payload message. Included space for 100 bytes for topic name + header
 */
bool publishToMQTT(const char msg[],const char topic[], bool retain)
{
  if(strlen(msg) > MQTT_MAX_PACKET_SIZE)
  {
    DPRINTFLN("publishToMQTT- Failed,Message too long:%u",strlen(msg));
    return false;
  }
  DPRINTFLN("msg:%s",msg);
  if(client.connected())
  {
    if(client.publish(topic,msg,retain))
    {
      DPRINTLN("publishToMQTT-Published.");
      if(mqtt_publish_fails>0)
        mqtt_publish_fails = 0;//reset the counter
      return true;
    }
    else
    {
      mqtt_publish_fails++;
      if(mqtt_publish_fails >= MAX_MQTT_PUBLISH_FAILURES)
      {
        DPRINTLN("publishToMQTT-Failed max allowed times. triggering ESP restart");
        MQTT_wd.update(false,true); // ask the watchdog to restart the ESP
      }
      else
      {
        // see if disconnecting the client will solve the issue
        client.disconnect();
        DPRINTLN("publishToMQTT-Failed, willfully disconnected MQTT.");
      }
    }
  }
  else
    DPRINTLN("Publish failed - MQTT not connected");
  return false;
}

/*
 * Creates a json string from the espnow message and publishes it to a MQTT queue. Truncates the message if it exceeds MAX_MESSAGE_LEN
 * Returns true if message was published successfully else false
 */
bool publishToMQTT(espnow_message msg) {
  char final_publish_topic[65] = "";
  char publish_topic[65] = "";
  // create a path for this specific device which is of the form MQTT_BASE_TOPIC/<master_id> , master_id is usually the mac address stripped off the colon eg. MQTT_BASE_TOPIC/2CF43220842D
  strcpy(publish_topic,MQTT_BASE_TOPIC);
  strcat(publish_topic,"/");
  strcat(publish_topic,msg.device_name); // from here on all messages would be published within this topic specific for this device
  strcpy(final_publish_topic,publish_topic);
  if(msg.msg_type == ESPNOW_SENSOR)
    strcat(final_publish_topic,STATE_TOPIC);// create a topic to publish the state of the device
  else if(msg.msg_type == ESPNOW_OTA)
    strcat(final_publish_topic,OTA_TOPIC);// create a topic to publish the ota state of the device
  else // unknown message type , publish this on the error topic
    strcat(final_publish_topic,ERROR_TOPIC);// create a topic to publish error

//  DPRINTF("publishToMQTT:%lu,%d,%d,%d,%d,%f,%f,%f,%f,%s,%s\n",msg.message_id,msg.intvalue1,msg.intvalue2,msg.intvalue3,msg.intvalue4,msg.floatvalue1,msg.floatvalue2,msg.floatvalue3,msg.floatvalue4,msg.chardata1,msg.chardata2);
  
  JsonDocument msg_json;
  msg_json["gateway"] = WiFi.hostname();
  msg_json["type"] = msg.msg_type;
  msg_json["mac"] = msg.sender_mac;
  msg_json["id"] = msg.message_id;
  msg_json["device"] = msg.device_name;
  msg_json["ival1"] = msg.intvalue1;
  msg_json["ival2"] = msg.intvalue2;
  msg_json["ival3"] = msg.intvalue3;
  msg_json["ival4"] = msg.intvalue4;
  msg_json["fval1"] = msg.floatvalue1;
  msg_json["fval2"] = msg.floatvalue2;
  msg_json["fval3"] = msg.floatvalue3;
  msg_json["fval4"] = msg.floatvalue4;
  msg_json["char1"] = msg.chardata1;
  msg_json["char2"] = msg.chardata2;

  // Serialize the JSON document to a string
  String str_msg;
  serializeJson(msg_json, str_msg);

  // Check if the length exceeds MAX_MESSAGE_LEN
  if (str_msg.length() >= MAX_MESSAGE_LEN) {
    // Calculate the excess length
    int excess_length = str_msg.length() - MAX_MESSAGE_LEN;

    // Truncate the char2 field by the excess length if it is within the limit of 64 characters
    if (excess_length < 64) {
      msg.chardata2[strlen(msg.chardata2) - excess_length] = '\0'; // Truncate the char2 field
      excess_length = 0;
    }
    else {
      // Truncate the char2 entirely and add a null terminator
      msg.chardata2[0] = '\0';
      excess_length = excess_length - 64;
    }
    if (excess_length < 64) {
      msg.chardata1[strlen(msg.chardata2) - excess_length] = '\0'; // Truncate the char2 field
      excess_length = 0;
    }
    // not proceeding with further truncation as there is no possibility of the string exceeding further

    // Re-serialize the JSON document to a string
    msg_json["char2"] = msg.chardata2;
    str_msg = "";
    serializeJson(msg_json, str_msg);
  }

  DPRINTF("Going to publish message with len:%u\n", str_msg.length());
  return publishToMQTT(str_msg.c_str(), final_publish_topic, false);
}

#if USING(MOTION_SENSOR)
/*
 * Creates a message string for motion ON message and publishes it to a MQTT queue
 * Returns true if message was published successfully else false
 */
bool publishMotionMsgToMQTT(const char topic_name[],const char state[4]) {
  char publish_topic[65] = "";
  // create a path for this specific device which is of the form MQTT_BASE_TOPIC/<master_id> , master_id is usually the mac address stripped off the colon eg. MQTT_BASE_TOPIC/2CF43220842D
  strcpy(publish_topic,MQTT_TOPIC);
  strcat(publish_topic,"/");
  strcat(publish_topic,topic_name);
  strcat(publish_topic,"/state");
  return publishToMQTT(state,publish_topic,false);
}
#endif

