vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
/*
 * Callback when data is sent , It sets the bResultReady flag to true on successful delivery of message
 * The flag is set to false in the main loop where data is sent and then the code waits to see if it gets set to true, if not it retires to send
 */
esp_now_send_cb_t OnDataSent([](uint8_t *mac_addr, uint8_t status) {
  deliverySuccess = status;
  //DPRINT("OnDataSent:Last Packet delivery status:\t");
  //DPRINTLN(status == 0 ? "Success" : "Fail");
  bResultReady = true;
});

/*
 * Callback called on sending a message.
 */
void OnDataRecv(uint8_t * mac, uint8_t *incomingData, uint8_t len) {
  espnow_message msg;
  memcpy(&msg, incomingData, sizeof(msg));
  DPRINTF("OnDataRecv:%lu,%d,%d,%d,%d,%d,%f,%f,%f,%f,%s,%s\n",msg.message_id,msg.msg_type,msg.intvalue1,msg.intvalue2,msg.intvalue3,msg.intvalue4,msg.floatvalue1,msg.floatvalue2,msg.floatvalue3,msg.floatvalue4,msg.chardata1,msg.chardata2);
  structQueue.push(msg);
};

/*
 * updates the gateway statistics , called before publishing a health message
 */
void update_gateway_stats()
{
  gateway.queue_length = structQueue.size();
  gateway.rssi = WiFi.RSSI();
  gateway.str_mac = WiFi.macAddress();
  gateway.str_macAP = WiFi.softAPmacAddress();
  gateway.uptime = millis()/6000; //publish uptime in minutes
  gateway.wifi_channel = WiFi.channel();
  gateway.msg_rate = (gateway.msg_count - last_message_count)/(float)(HEALTH_INTERVAL/(60*1000));//rate calculated over one minute
  last_message_count = gateway.msg_count;//reset the count
  gateway.free_mem_KB = ESP.getFreeHeap()/ 1024.0;
}

/*
 * creates data for health message and publishes it
 * takes bool param init , if true then publishes the startup message else skips it. It always publishes the normal health check message
 */
bool publishHealthMessage(bool init=false)
{
  char publish_topic[65] = "";
  String str_msg="";
  bool return_value = false;
  update_gateway_stats();

  JsonDocument msg_json;//It is recommended to create a new obj than reuse the earlier one by ArduinoJson

  if(init)
  {
     // publish the init message
    msg_json["version"] = compile_version;
    msg_json["tot_memKB"] = (float)ESP.getFlashChipSize() / 1024.0;
    msg_json["mac"] = gateway.str_mac;
    msg_json["macAP"] = gateway.str_macAP;
    msg_json["wifiChannel"] = gateway.wifi_channel;
    strcpy(publish_topic,MQTT_TOPIC);
    strcat(publish_topic,"/init");
    str_msg="";
    serializeJson(msg_json,str_msg);
    return_value = publishToMQTT(str_msg.c_str(),publish_topic,true);
  }
  if (!return_value)
    DPRINTLN("Failed to publish init message:" + str_msg);
  
  // clear the old object for reuse for the next message
  msg_json.clear();
  msg_json["uptime"] = gateway.uptime; // uptime in minutes
  msg_json["mem_freeKB"] = serialized(String((float)gateway.free_mem_KB,0));//Ref:https://arduinojson.org/v6/how-to/configure-the-serialization-of-floats/
  msg_json["msg_count"] = gateway.msg_count;
  msg_json["queue_len"] = gateway.queue_length;
  last_message_count = gateway.msg_count;//reset the count
  msg_json["msg_rate"] = serialized(String(gateway.msg_rate,1));//format with 1 decimal places, Ref:https://arduinojson.org/v6/how-to/configure-the-serialization-of-floats/

  // create a path for this specific device which is of the form MQTT_BASE_TOPIC/<master_id> , master_id is usually the mac address stripped off the colon eg. MQTT_BASE_TOPIC/2CF43220842D
  strcpy(publish_topic,MQTT_TOPIC);
  strcat(publish_topic,"/state");
  serializeJson(msg_json,str_msg);
  return_value &= publishToMQTT(str_msg.c_str(),publish_topic,false);
  if (!return_value)
    DPRINTLN("Failed to publish state message:" + str_msg);

  // publish the wifi message , I am publishing this everytime because it also has rssi
  String strIP_address = WiFi.localIP().toString();
  msg_json.clear();
  msg_json["ip_address"] = strIP_address;
  msg_json["rssi"] = WiFi.RSSI();
  strcpy(publish_topic,MQTT_TOPIC);
  strcat(publish_topic,"/wifi");
  str_msg="";
  serializeJson(msg_json,str_msg);
  return_value &= publishToMQTT(str_msg.c_str(),publish_topic,true);
  if (!return_value)
    DPRINTLN("Failed to publish wifi message:" + str_msg);

  return return_value;
}


void printInitInfo()
{
  DPRINTLN("Starting up as a ESPNow Gateway");
  #if USING(MOTION_SENSOR)
    DPRINTLN("Motion sensor ON");
  #else
    DPRINTLN("Motion sensor OFF");
  #endif
  #if USING(SECURITY)
    DPRINTLN("Security ON");
  #else
    DPRINTLN("Security OFF");
  #endif

}

void notFound(AsyncWebServerRequest *request) {
  request->send(404, "text/plain", "URL Not found");
}

/*
 * Adds ESP MAC as a peer to which OTA messages need to be send and sets the relevant flags. The loop() then takes care of sending the messages to this device
 * param: peerAddress: address of the peer as an uint8 array
 * param: duration : duration in sec for which to keep sending this message
 * param: stop_on_delivery : flag to indicate it it should stop sending messages once it gets the delivery confirmation
 */
void prepare_for_OTA(uint8_t peerAddress[])
{
//  espnow_message myData;
  #if(USING(SECURITY))
    refreshPeer(peerAddress, key,RECEIVER_ROLE);
  #else
    refreshPeer(peerAddress, NULL,RECEIVER_ROLE);
  #endif
  // If devicename is not given then generate one from MAC address stripping off the colon
  #ifdef DEVICE_NAME
    strcpy(myData.device_name,DEVICE_NAME);
  #else
    String wifiMacString = WiFi.macAddress();
    wifiMacString.replace(":","");
    snprintf(myData.device_name, 16, "%s", wifiMacString.c_str());
  #endif
  myData.msg_type = ESPNOW_OTA;
  esp_ota_device.ota_mode = true; // set the ota flag which will trigger the OTA flow in loop()
  esp_ota_device.ota_done = false; // reset the success flag
  start_time = millis(); // start the timer
  //DPRINTLN("Device prepared for sending OTA messages:%02X:%02X:%02X:%02X:%02X:%02X ",peerAddress[0],peerAddress[1],peerAddress[2],peerAddress[3],peerAddress[4],peerAddress[5]);
  DPRINTLN("Device prepared for sending OTA messages");
}

// Appends one HTML table row for the given message to the response stream
static void print_table_row(AsyncResponseStream *response, const espnow_message& msg) {
  response->print(F("<tr><td data-client-time></td>"));
  response->printf("<td>%lu</td>", msg.message_id);
  response->printf("<td>%s</td>", msg.device_name);
  response->printf("<td>%d</td>", (int)msg.msg_type);
  response->printf("<td>%s</td>", msg.sender_mac);
  response->printf("<td>%d</td><td>%d</td><td>%d</td><td>%d</td>",
                   msg.intvalue1, msg.intvalue2, msg.intvalue3, msg.intvalue4);
  response->printf("<td>%.2f</td><td>%.2f</td><td>%.2f</td><td>%.2f</td>",
                   msg.floatvalue1, msg.floatvalue2, msg.floatvalue3, msg.floatvalue4);
  response->printf("<td>%s</td><td>%s</td>", msg.chardata1, msg.chardata2);
  response->print(F("</tr>\n"));
}

// Streams the common page skeleton, the rows of the given buffer are printed inside the table
template <typename QUEUE>
static void send_message_page(AsyncWebServerRequest *request, const char* heading, const QUEUE& queue, bool with_ws) {
  AsyncResponseStream *response = request->beginResponseStream("text/html");
  response->print(FPSTR(html_head));
  response->print(DEVICE_NAME);
  response->print(FPSTR(html_style));
  response->print(heading);
  response->print(FPSTR(html_table_start));
  // print the newest message first
  for (int i = (int)queue.size() - 1; i >= 0; i--) {
    print_table_row(response, queue[i]);
  }
  response->print(FPSTR(html_table_end));
  if (with_ws) {
    response->print(FPSTR(ws_script));
  }
  response->print(FPSTR(html_end));
  request->send(response);
}

// Function to handle the root URL
void handleRoot(AsyncWebServerRequest *request) {
  send_message_page(request, DEVICE_NAME " - Dashboard", processedMessages, true);
}

// Function to handle the queue URL
void handle_queue(AsyncWebServerRequest *request) {
  send_message_page(request, DEVICE_NAME " - Queued Messages", structQueue, false);
}


void config_webserver()
{
  server.on("/", HTTP_GET, handleRoot);
  server.on("/queue", HTTP_GET, handle_queue);
  
  #if(USING(ESPNOW_OTA_SERVER))
  server.on("/ota", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/html", index_html_ota);
  });

  // Handles OTA request for an ESPNOW device
  server.on("/espnowota", HTTP_GET, [] (AsyncWebServerRequest *request) {
    String mac_addr , response_msg;
    // OTA can be triggered only for one device at a time, reject this request if one is already in progress
    if(!esp_ota_device.ota_mode)
    {
      if (request->hasParam(input_param_mac)) {
        mac_addr = request->getParam(input_param_mac)->value();
        if(validate_MAC(mac_addr.c_str()))
        {
          DPRINTFLN("MAC %s is valid",mac_addr.c_str());
          mac_addr.replace(MAC_DELIMITER,"");
          MAC_to_array(mac_addr.c_str(),esp_ota_device.mac,6);
          // now extract the other params
          String str_temp;
          if (request->hasParam("input_duration")) {
            str_temp = request->getParam("input_duration")->value();
            if(isNumeric(str_temp))
              esp_ota_device.duration = (short)str_temp.toInt();
            else
              esp_ota_device.duration = OTA_TRIGGER_DURATION;
          }
          if (request->hasParam("input_interval")) {
            str_temp = request->getParam("input_interval")->value();
            if(isNumeric(str_temp))
              esp_ota_device.interval = (short)str_temp.toInt();
            else
              esp_ota_device.interval = OTA_MSG_INTERVAL;
          }
          prepare_for_OTA(esp_ota_device.mac);
          response_msg = "ESPNOW OTA req sent to device: ";
        }
        else
        {
          response_msg = "MAC address provided in invalid : ";
          DPRINTFLN("MAC %s is invalid",mac_addr.c_str());
        }
      }
      else 
      {
        mac_addr = "none";
      }
    }
    else
    {
      char buffer[18];
      sprintf(buffer, "%02X:%02X:%02X:%02X:%02X:%02X",esp_ota_device.mac[0],esp_ota_device.mac[1],esp_ota_device.mac[2],esp_ota_device.mac[3],esp_ota_device.mac[4],esp_ota_device.mac[5] );
      response_msg = "OTA already in progress for device: " + String(buffer);
      DPRINTLN(response_msg);
    }
    request->send(200, "text/html", response_msg + mac_addr + " <br><a href=\"/\">Return to Home Page</a>");
  });
  #endif
  server.onNotFound(notFound);
  server.addHandler(&ws); // for websocket
  server.begin();  
}


