vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
/*
 * Initializes the ESP with espnow and WiFi client , OTA etc
 */
void setup() {
  // Initialize Serial Monitor , if we're usng pin 3 on ESP8266 for PIR then initialize Serial as Tx only , disable Rx
  // ATTENTION : this is not working as inteded as PIR still holds Rx as LOW while startup and so the ESP doesnt boot
  // As a temp solution , dont turn ON Serial if you're using Rx as PIR PIN
  #if USING(MOTION_SENSOR)
  if(PIR_PIN == 3)
    {DBEGIN(115200, SERIAL_8N1, SERIAL_TX_ONLY);}
  else
    {DBEGIN(115200);}
  #else
    {DBEGIN(115200);}
  #endif

  DPRINTFLN("Value of MQTT_MAX_PACKET_SIZE is %u",MQTT_MAX_PACKET_SIZE);
  printInitInfo();

  // Set the device as a Station and Soft Access Point simultaneously
  // This has to be WIFI_AP_STA and not WIFI_STA, if set to WIFI_STA then it can only receive broadcast messages and stops receiving MAC specific messages.
  // The main problem seems to be caused by the station mode WiFi going into sleep mode while you have no work. This means that it does not listen to receive ESP-Now packets
  // and therefore they are lost. To solve this we will have to force our microcontroller to listen continuously, and this is achieved by turning it into an AP (Access Point)
  WiFi.mode(WIFI_AP_STA); 

  // Set a custom MAC address for the device. This is helpful in cases where you want to replace the actual ESP device in future
  // A custom MAC address will allow all sensors to continue working with the new device and you will not be required to update code on all devices
  uint8_t customMACAddress[] = DEVICE_MAC; // defined in Config.h
  setCustomMAC(customMACAddress,false);

  pinMode(STATUS_LED,OUTPUT);
  WiFi.config(ESP_IP_ADDRESS, default_gateway, subnet_mask);//from secrets.h
  String device_name = DEVICE_NAME;
  device_name.replace("_","");//hostname dont allow underscores or spaces
  device_name.replace(" ","-");//hostname dont allow underscores or spaces
  char hostname[24];
  strncpy(hostname, device_name.c_str(), 23); //hostname can be a max of 24 chars only
  hostname[23] = '\0'; // Ensure null termination
  WiFi.hostname(hostname); // Set Hostname.  

  // Connect to the WiFi as a station device
  DPRINTLN("Connecting to " + String(ssid) + " with hostname " + String(hostname));
  WiFi.begin(ssid, password);
  DPRINTLN("Setting as a Wi-Fi Station..");
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    DPRINT(".");
  }
  DPRINT("Station IP Address: ");
  DPRINTLN(WiFi.localIP());
  DPRINT("Wi-Fi Channel: ");
  DPRINTLN(WiFi.channel());
  last_wifi_channel = WiFi.channel();//store the channel number for future comparison
  WiFi.setAutoReconnect(true);
  
  //mdns is necessary to broadcast the hostname.local address
  if(MDNS.begin(WiFi.getHostname(),WiFi.localIP()))
    {DPRINT("MDNS set up successfully with hostname: ");DPRINTLN(WiFi.getHostname());
    }
  else
    DPRINTLN("error setting up MDNS");

  if((WiFi.status() == WL_CONNECTED))
  {
    client.setServer(mqtt_broker, mqtt_port);// from secrets.h
  }
  // Init ESP-NOW
  if (esp_now_init() != ESP_OK) {
    DPRINTLN("Error initializing ESP-NOW");
    return;
  }
  
  esp_now_set_self_role(MY_ROLE);
  #if USING(SECURITY)
  // Setting the PMK key
  esp_now_set_kok(kok, KEY_LEN);
  byte channel = wifi_get_channel();
  // Add each controller who is expected to send a message to this gateway
  for(byte i = 0;i< sizeof(controller_mac)/6;i++)
  {
    esp_now_add_peer(controller_mac[i], RECEIVER_ROLE, channel, key, KEY_LEN);
    DPRINTFLN("Added controller :%02X:%02X:%02X:%02X:%02X:%02X",controller_mac[i][0],controller_mac[i][1],controller_mac[i][2],controller_mac[i][3],controller_mac[i][4],controller_mac[i][5] );
  }
   #endif

  esp_now_register_send_cb(OnDataSent);
  esp_now_register_recv_cb(OnDataRecv);
  DPRINT("WiFi address:");DPRINTLN(WiFi.macAddress());
  DPRINT("SoftAP address:");DPRINTLN(WiFi.softAPmacAddress());

  ArduinoOTA.onStart([]() {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH) {
      type = "sketch";
    } else { // U_FS
      type = "filesystem";
    }

    // NOTE: if updating FS this would be the place to unmount FS using FS.end()
    DPRINTLN("Start updating " + type);
  });
  ArduinoOTA.onEnd([]() {
    DPRINTLN("\nEnd");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    DPRINTF("Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    DPRINTF("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) {
      DPRINTLN("Auth Failed");
    } else if (error == OTA_BEGIN_ERROR) {
      DPRINTLN("Begin Failed");
    } else if (error == OTA_CONNECT_ERROR) {
      DPRINTLN("Connect Failed");
    } else if (error == OTA_RECEIVE_ERROR) {
      DPRINTLN("Receive Failed");
    } else if (error == OTA_END_ERROR) {
      DPRINTLN("End Failed");
    }
  });
  ArduinoOTA.begin();
  config_webserver();
  //set MQTT buffer size
  if(client.getBufferSize() < MAX_MSG_BUFFER_SIZE)
  {
    if(!client.setBufferSize(MAX_MSG_BUFFER_SIZE))
      {DPRINTFLN("Failed to set MQTT buffer size to %d. Any messages over %d will fail to publish",MAX_MSG_BUFFER_SIZE,MQTT_MAX_PACKET_SIZE);}
    else
      {DPRINTFLN("Set MQTT buffer size to %d",MAX_MSG_BUFFER_SIZE);}
  }
  
  reconnectMQTT(); //connect to MQTT before publishing the startup message
  if(publishHealthMessage(true)) //publish the startup message
    initialized = true;
  #if USING(MOTION_SENSOR)
  if(!motion_sensor.begin(MOTION_SENSOR_NAME)) //initialize the motion sensor
    DPRINTLN("Failed to initialize motion sensor");
  #endif
  
  ha_api.setHAServer(ha_url, ha_port);
  ha_api.setHAPassword(ha_token);

}

/*
 * processes the command type messages which are calls to Home Assistant APIs with actions
 * at present always returns true, which means does not retry if failed.
 */
bool process_command_message(espnow_message &msg)
{
  if(msg.msg_type != ESPNOW_COMMAND)
    return false;
  char msg_data[sizeof(msg.chardata1)*2] = "";
  strcpy(msg_data,msg.chardata1);
  DPRINTLN(msg_data);
  strcat(msg_data,msg.chardata2);
  DPRINTLN(msg_data);
  char delim[] = "|";
  char *ptr = strtok(msg_data, delim);
  String domain = String(ptr);
  ptr = strtok(NULL, delim);
  String action = String(ptr);
  ptr = strtok(NULL, delim);
  String data = String(ptr);

  String serviceURL = "/api/services/";
  serviceURL = serviceURL + domain + "/" + action;
  DPRINTLN(serviceURL);
  DPRINTLN(data);
  ha_api.sendPostHA(serviceURL,data);
  return true;
}


#if USING(MOTION_SENSOR)
/*
 * determines the state of motion sensor and publishes a message accordingly
 */
void update_motion_sensor()
{
  short motion_state = motion_sensor.update();
  if(motion_state == 1)
  {
    DPRINTLN("Motion detected as ON");
    publishMotionMsgToMQTT(motion_sensor.getSensorName(),"on");
  }
  else if(motion_state == 2)
  {
    DPRINTLN("Motion detected as OFF");
    publishMotionMsgToMQTT(motion_sensor.getSensorName(),"off");
  }
}
#endif

