vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
void do_ota_server()
{
  #if(USING(ESPNOW_OTA_SERVER))
    if(esp_ota_device.ota_mode && !esp_ota_device.ota_done)
    {
      if(millis() < (start_time + esp_ota_device.duration*1000))
      {
        if((millis() - last_msg_sent_time) > esp_ota_device.interval)
        {
          myData.message_id = millis();
          bool result = sendESPnowMessage(&myData,esp_ota_device.mac,0,false);
          last_msg_sent_time = millis();
          //yield();// trying this out to see if the MQTT disconect bug gets solved
          if(result)
          {
            //DPRINTFLN("%lu: sent OTA message",myData.message_id);
          }
          else
          {
            DPRINTFLN("%lu: OTA message sending failed",myData.message_id);}
        }
      }
      else
      {
        esp_ota_device.ota_mode = false;
        esp_ota_device.ota_done = true;
        delete_peer(esp_ota_device.mac);// now that we're done with OTA , delete the peer
        DPRINTLN("OTA timed out without acknowlegdment from device");
      }
    }
  #endif

}

/*
 * Checks if the WiFi channel has changed from last time, returns true if it has, false otherwise.
 */
bool is_wifi_channel_changed() {
  return WiFi.channel() != last_wifi_channel; // no side effects
}

/*
 * Performs periodic health checks and publishes health messages.
 * If the WiFi channel has changed, it triggers the publishing of a fresh device info message.
 */
void do_health_check()
{
  if(millis() - last_time > HEALTH_INTERVAL)
  {
    bool channel_changed = is_wifi_channel_changed();
    if(!initialized || channel_changed)
    {
      if(publishHealthMessage(true))
      {
        initialized = true;
        if(channel_changed)
          last_wifi_channel = WiFi.channel(); // commit only after a successful publish
      }
    }
    else
    {
      publishHealthMessage();
    }
    last_time = millis();
  }
}

void do_queue_check()
{
  if(structQueue.isFull())
  {
    DPRINTLN("Queue Full, restarting ESP to see if the issue goes away, messages will be lost");
    MQTT_wd.update(false,true); // ask the watchdog to restart the ESP
  }
}

void add_message_to_processed_queue(espnow_message msg)
{
  processedMessages.push(msg);
 // Notify WebSocket clients about the new message
  JsonDocument doc;
  doc["message_id"] = msg.message_id;
  doc["device_name"] = msg.device_name;
  doc["msg_type"] = msg.msg_type;
  doc["sender_mac"] = msg.sender_mac;
  doc["intvalue1"] = msg.intvalue1;
  doc["intvalue2"] = msg.intvalue2;
  doc["intvalue3"] = msg.intvalue3;
  doc["intvalue4"] = msg.intvalue4;
  doc["floatvalue1"] = msg.floatvalue1;
  doc["floatvalue2"] = msg.floatvalue2;
  doc["floatvalue3"] = msg.floatvalue3;
  doc["floatvalue4"] = msg.floatvalue4;
  doc["chardata1"] = msg.chardata1;
  doc["chardata2"] = msg.chardata2;
  String json;
  serializeJson(doc, json);
  ws.textAll(json);
}

void process_message()
{
  static bool retry_message = false; // flag to indicate to retry sending of message in case of failure

  if(!structQueue.isEmpty())
    if(!retry_message)
      currentMessage = structQueue.pop();
    //else last message content is still there is currentMessage
  
  if(currentMessage != emptyMessage)
  {
    DPRINTFLN("Processing msg:%lu,%d",currentMessage.message_id,currentMessage.msg_type);
    if(currentMessage.msg_type == ESPNOW_SENSOR)
    {
      if(publishToMQTT(currentMessage))
      {
        gateway.msg_count++;
        add_message_to_processed_queue(currentMessage);
        currentMessage = emptyMessage;
        retry_message = false;
      }
      else
      {
        retry_message = true;
      }//else the same message will be retried the next time
    }
    else if(currentMessage.msg_type == ESPNOW_COMMAND)
    {
      if(process_command_message(currentMessage))
      {
        gateway.msg_count++;
        gateway.cmnd_msg_count++;
        currentMessage = emptyMessage;
        retry_message = false;
      }
      else
      {
        retry_message = true;
      }//else the same message will be retried the next time
    }
    #if(USING(ESPNOW_OTA_SERVER))
    else if(currentMessage.msg_type == ESPNOW_OTA)
    {
      if(esp_ota_device.ota_mode)
      {
        char buffer[18];
        sprintf(buffer, "%02X:%02X:%02X:%02X:%02X:%02X",esp_ota_device.mac[0],esp_ota_device.mac[1],esp_ota_device.mac[2],esp_ota_device.mac[3],esp_ota_device.mac[4],esp_ota_device.mac[5] );
        if(xstrcmp(buffer,currentMessage.sender_mac))
        {
          esp_ota_device.ota_mode = false;
          esp_ota_device.ota_done = true;
          delete_peer(esp_ota_device.mac);// now that we're done with OTA , delete the peer
          DPRINTLN("OTA successfuly completed for device:");
        }
        else
          {DPRINTFLN("MAC address of OTA device did not match. Target mac: %s , MAC in msg: %s",buffer,currentMessage.sender_mac);}
      }
      else
        DPRINTLN("OTA ack message received when not in OTA mode, ignoring...");
      // pubish the OTA message to MQTT
      publishToMQTT(currentMessage);
      gateway.msg_count++;
      currentMessage = emptyMessage;
    }
    #endif
    else
    {
      DPRINTLN("message received without msg_type set, ignoring...");
      gateway.msg_count++;
      currentMessage = emptyMessage;
    }
  }

}


/*
 * This is the main loop where the code waits for the delivery of the message sent
 * If the message is not delivered within the timeout then it retries to send the message
 * The message is sent only once and the code waits for the delivery confirmation
 */
void loop() {
  //check for MQTT connection
  if (!client.connected()) 
  {
    reconnectMQTT(); // Attempt to reconnect
  } else {
    client.loop(); // Client connected
  }
  MQTT_wd.update(client.connected()); //feed the watchdog by calling update
  
  #if USING(MOTION_SENSOR)
    update_motion_sensor();
  #endif

  ArduinoOTA.handle();
  if(client.connected())
  {
    process_message();
  }
  do_health_check();
  //do_queue_check(); // commenting for now as I have to debug other issues, should uncomment it later
  statusLED.loop();
  do_ota_server();
  MDNS.update(); // Let MDNS advertise the hostname

}
